# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv8 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolov8
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 3 # number of classes


# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [ -1, 1, MobileOne_s1, [] ]



# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # Upsample P5
  - [[-1, -2], 1, Concat, [1]]  # concat P4
  - [-1, 3, C2f, [512]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # Upsample
  - [[-1, -4], 1, Concat, [1]]  # concat P3
  - [-1, 3, C2f, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 2], 1, Concat, [1]]  # cat P4
  - [-1, 3, C2f, [512]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 0], 1, Concat, [1]]  # cat P5
  - [-1, 3, C2f, [1024]]

  - [[5, 8, 11], 1, Detect, "nc=3, ch=[192, 512, 1280]"]


  # ✅ 正确写法




# 关闭所有增强策略
augment: True
auto_augment: ''
hsv_h: 0.0
hsv_s: 0.0
hsv_v: 0.0
fliplr: 0.0
flipud: 0.0
mosaic: 1.0
mixup: 0.0
copy_paste: 0.0
erasing: 0.0
perspective: 0.0
translate: 0.0
scale: 0.0
shear: 0.0


